tsung-requests/task3/http_endpoint2.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">  
  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
  <servers>
    <server host="192.168.1.100" port="8080" type="tcp"></server>
  </servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default 
  <monitoring>
    <monitor host="10.8.0.1" type="snmp"></monitor>
  </monitoring>
--> 
  
  <load duration="30" unit="minute">
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="30" unit="minute">
     <users maxnumber="9" arrivalrate="1" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="50">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="50">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <!-- endpoint2 -->
  <session name="endpoint2" weight="1" type="ts_http">
      <for from="1" to="10000000" incr="1" var="counter">
          <setdynvars sourcetype="random_number" start="1" end="50">
              <var name="delay" />
          </setdynvars>
          
          <request>
              <http url="/api/endpoint2" contents="start_date=2010-01-14&amp;end_date=2010-05-16&amp;delay=%%_delay%%" method="GET" version="1.1"></http>
              <thinktime value="10" random="true"></thinktime>
          </request>
      </for>
  </session>
  
 </sessions>
</tsung>